-- phpMyAdmin SQL Dump
-- version 5.0.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 18, 2020 at 09:54 PM
-- Server version: 10.4.11-MariaDB
-- PHP Version: 7.2.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `sch`
--

-- --------------------------------------------------------

--
-- Table structure for table `class`
--

CREATE TABLE `class` (
  `id_class` int(11) NOT NULL,
  `nameclass` varchar(225) NOT NULL,
  `date` varchar(48) NOT NULL,
  `time` int(11) NOT NULL,
  `link` varchar(225) NOT NULL,
  `color` varchar(55) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `class`
--

INSERT INTO `class` (`id_class`, `nameclass`, `date`, `time`, `link`, `color`) VALUES
(3, 'التانية بكالوريا', '17.03.2020', 1584449745, '4321384', 'danger'),
(4, 'الاولى بكالوريا', '17.03.2020', 1584449766, '3117016', 'warning'),
(5, 'جدع مشترك', '17.03.2020', 1584449806, '9202306', 'success'),
(6, 'التالتة إعدادي', '17.03.2020', 1584449833, '9763103', 'danger'),
(7, ' التانية إعدادي', '17.03.2020', 1584449864, '4375910', 'primary'),
(8, 'الاولى إعدادي', '17.03.2020', 1584449909, '7005827', 'secondary'),
(9, 'السادس إبتدائي', '17.03.2020', 1584449938, '90598', 'warning'),
(10, 'الخامس إبتدائي', '17.03.2020', 1584449980, '1672126', 'primary'),
(11, 'الرابع إبتدائي', '17.03.2020', 1584450002, '3257537', 'success'),
(12, 'التالت إبتدائي', '17.03.2020', 1584450029, '3940320', 'danger'),
(13, 'التاني إبتدائي', '17.03.2020', 1584450047, '4780574', 'secondary'),
(14, 'الأول إبتدائي', '17.03.2020', 1584450075, '1678867', 'primary');

-- --------------------------------------------------------

--
-- Table structure for table `comment`
--

CREATE TABLE `comment` (
  `id_cmnt` int(11) NOT NULL,
  `name` varchar(225) NOT NULL,
  `text` text NOT NULL,
  `date` varchar(225) NOT NULL,
  `time` int(11) NOT NULL,
  `ip` varchar(225) NOT NULL,
  `link` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `comment`
--

INSERT INTO `comment` (`id_cmnt`, `name`, `text`, `date`, `time`, `ip`, `link`) VALUES
(1, 'dsfgdfgdfg', 'fdgdfgdfg', '18.03.2020', 1584548030, '::1', 0),
(2, 'werwer', 'werwer', '18.03.2020', 1584548051, '::1', 0),
(3, 'me name', 'ertretyry', '18.03.2020', 1584548821, '::1', 5944097),
(4, 'me name', 'cv', '18.03.2020', 1584549127, '::1', 5944097),
(5, 'مستخدم موقع', 'fin cv', '18.03.2020', 1584549305, '::1', 5944097),
(6, 'مستخدم موقع', 'cv', '18.03.2020', 1584549339, '::1', 5944097),
(7, 'مستخدم موقع', 'jjh\n', '18.03.2020', 1584549420, '::1', 5944097),
(8, 'مستخدم موقع ', 'cv', '18.03.2020', 1584563052, '::1', 3823389),
(9, 'مستخدم موقع ', 'test by youssef elhaimer', '18.03.2020', 1584563116, '::1', 3823389);

-- --------------------------------------------------------

--
-- Table structure for table `doros`
--

CREATE TABLE `doros` (
  `id_dars` int(11) NOT NULL,
  `title` varchar(225) NOT NULL,
  `link` varchar(225) NOT NULL,
  `linkclass` int(11) NOT NULL,
  `linkmat` int(11) NOT NULL,
  `date` varchar(44) NOT NULL,
  `time` int(11) NOT NULL,
  `yes` int(11) NOT NULL,
  `no` int(11) NOT NULL,
  `vue` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `doros`
--

INSERT INTO `doros` (`id_dars`, `title`, `link`, `linkclass`, `linkmat`, `date`, `time`, `yes`, `no`, `vue`) VALUES
(4, 'حرف الواو', 'INhqFwtyyhk', 1678867, 8142474, '17.03.2020', 1584477940, 0, 0, 0),
(5, ' | التاريخ – العالم غداة الحرب العالمية الأولى', 'yAaSDBj3fok', 4321384, 4341229, '17.03.2020', 1584478293, 0, 0, 0),
(6, ' آداب و علوم إنسانية | التاريخ – العالم غداة الحرب العالمية الأولى', '2OvP0Df0LcE', 4321384, 4341229, '18.03.2020', 1584487067, 0, 0, 0),
(7, 'حصة للمراجعة الجزء الرابع ', 'wzJAS_iQ0-o', 4321384, 3823389, '18.03.2020', 1584552988, 0, 0, 0),
(8, 'حصة للمراجعة:الثانية باك الجزء الثالث', 'O4AcDiICzbw', 4321384, 3823389, '18.03.2020', 1584553068, 0, 0, 0),
(9, 'حصة المراجعة المجزوءة الأولى: الجزء الثاني', 'lB9t71Jk5hw', 4321384, 3823389, '18.03.2020', 1584553119, 0, 0, 0),
(11, 'حصة للمراجعة: المجزوءة الأولى؛ الثانية باك', 'Zy1XEiVZl8g', 4321384, 3823389, '18.03.2020', 1584553207, 0, 0, 0),
(12, 'النص السردي: القصة', 'tYJloUvQDW4', 4321384, 3823389, '18.03.2020', 1584553328, 0, 0, 0),
(14, 'مدخل إلى فهم المنهج الاجتماعي- الثانية باك آداب وعلوم إنسانية.', '-XU2t_o0O9g', 4321384, 3823389, '18.03.2020', 1584553795, 0, 0, 0),
(15, ' مؤلف اللص و الكلاب || الجزء الأول : القراءة التوجيهية】', '5dWcbRxHPWc', 4321384, 3823389, '18.03.2020', 1584553836, 0, 0, 0),
(16, 'مؤلف اللص و الكلاب || الجزء الثاني : القراءة التحليلية】', 'Dbc2ybfpn34', 4321384, 3823389, '18.03.2020', 1584553875, 0, 0, 0),
(19, 'المقارنة بين القصة والمسرحية (أوجة التشابه والاختلاف', 'j3DnwQ1XmNE', 4321384, 3823389, '18.03.2020', 1584553984, 0, 0, 0),
(20, 'درس علوم اللغة: الخطاطة السردية + نموذج تطبيقي', 'UzbUt6DHlIg', 4321384, 3823389, '18.03.2020', 1584554018, 0, 0, 0),
(21, 'العلوم اللغة: درس اتساق (مراجعة سهلة سريعة', 'yj0MZDCw6HE', 4321384, 3823389, '18.03.2020', 1584554057, 0, 0, 0),
(22, 'العلوم اللغة: درس اتساق (مراجعة سهلة سريعة)', 'yj0MZDCw6HE', 4321384, 3823389, '18.03.2020', 1584554106, 0, 0, 0),
(23, 'تلخيص موجز وشامل لجميع أحداث رواية اللص والكلاب', 'h4EYnJ5C-tI', 4321384, 3823389, '18.03.2020', 1584554146, 0, 0, 0),
(24, 'الفرق بين المقالة الأدبية والنقدية', 'beNfJdJBn-M', 4321384, 3823389, '18.03.2020', 1584554185, 0, 0, 0),
(25, 'Travaux encadrés : Biographie de Mohammed Khair-Eddine', 'ddg4byCoF0s', 4321384, 9499017, '18.03.2020', 1584555951, 0, 0, 0),
(26, 'Module II Lecture 2bac', '9LdKb_MUrB4', 4321384, 9499017, '18.03.2020', 1584555993, 0, 0, 0),
(27, 'Travaux encadrés : Biographie de Honoré de Balzac ( le père Goriot)', 'Fi8gl40lp2k', 4321384, 9499017, '18.03.2020', 1584556028, 0, 0, 0),
(28, 'Travaux encadrés : Résumé du roman ( le père Goriot )', 'XGf6qHnlq2M', 4321384, 9499017, '18.03.2020', 1584556068, 0, 0, 0),
(29, 'expressing advice 2', 'h4a3Ep6BESs', 4321384, 2177550, '18.03.2020', 1584556193, 0, 0, 0),
(30, 'EasyGlish Expressing Addition & Concession - Communication - شرح الدرس بالدارجة المغربية', '1vWIGTB83bU', 4321384, 2177550, '18.03.2020', 1584556257, 0, 0, 0),
(31, 'Relative Pronouns & Clauses - English Grammar Lesson', 'lLkARyk4CTI', 4321384, 9499017, '18.03.2020', 1584556289, 0, 0, 0),
(32, 'Past continuous', 'NEMi15bEzRs', 4321384, 2177550, '18.03.2020', 1584556376, 0, 0, 0),
(33, 'الحكاية 10 : العصفور و الحريق', 'k-9JKI9qWw0/hqdefault.jpg', 1678867, 8142474, '18.03.2020', 1584556481, 0, 0, 0),
(34, 'الحكاية 9 : شادي و العصفور', 'LBuS8-QqrNY', 1678867, 8142474, '18.03.2020', 1584557357, 0, 0, 0),
(35, 'الحكاية 8 : آية و السلحفاة', 'Zlq1OnPNbeo', 1678867, 8142474, '18.03.2020', 1584557378, 0, 0, 0),
(36, 'فيديو يوضح طريقة تثنيت وعمل برنامج القراءة المقطعية', 'RtYXOIKEXuE', 1678867, 8142474, '18.03.2020', 1584557417, 0, 0, 0),
(37, 'الحروف والحركات : 28- حرف الياء', 'kt1h0SY0UfQ', 1678867, 8142474, '18.03.2020', 1584557461, 0, 0, 0),
(38, 'الحروف والحركات : 26- حرف الهاء', 'cmL1FvIcZzg', 1678867, 8142474, '18.03.2020', 1584557504, 0, 0, 0),
(39, 'الحروف والحركات : 25- حرف النون', '9Av32c1hToo', 1678867, 8142474, '18.03.2020', 1584557522, 0, 0, 0),
(40, 'الحروف والحركات : 24- حرف الميم', 'NajgqCmk6MY', 1678867, 8142474, '18.03.2020', 1584557564, 0, 0, 0),
(41, 'الحروف والحركات : 23- حرف اللام', 'favBVZ2aXgw', 1678867, 8142474, '18.03.2020', 1584558878, 0, 0, 0),
(42, 'الحروف والحركات : 22- حرف الكاف', 'https://img.youtube.com/vi/Dguv1qu-G7w', 1678867, 8142474, '18.03.2020', 1584558950, 0, 0, 0),
(43, 'الحروف والحركات : 21- حرف القاف', 'e3sGtKmEcrE', 1678867, 8142474, '18.03.2020', 1584558995, 0, 0, 0),
(44, 'الحروف والحركات : 20- حرف الفاء', 'vFRiln2Kue4', 1678867, 8142474, '18.03.2020', 1584559040, 0, 0, 0),
(45, 'الحروف والحركات : 19- حرف الغين', 'K-J2pN_8B-Y', 1678867, 8142474, '18.03.2020', 1584559939, 0, 0, 0),
(46, 'Les légumes', '6_4qiyRymhw', 1678867, 2781558, '18.03.2020', 1584561786, 0, 0, 0),
(47, 'Communicationⴰⵎⵙⴰⵡⴰⴹ', 'Qav6MbXdg1g', 1678867, 2781558, '18.03.2020', 1584561848, 0, 0, 0),
(48, 'درس داعم بعنوان الطرح باستخدام تقنية الشطب', 'B9kz1-TOSYA', 1678867, 2652944, '18.03.2020', 1584561881, 0, 0, 0),
(49, 'المنادى', 'DXLbhWA1-_o', 90598, 4575535, '18.03.2020', 1584561961, 0, 0, 0),
(50, 'المستثنى بغير و سوى', 'GbNyXt8JImg', 90598, 4575535, '18.03.2020', 1584561983, 0, 0, 0),
(51, 'المرابطون', 'bxAggYStx5o', 90598, 5648300, '18.03.2020', 1584562018, 0, 0, 0),
(52, 'الفتح الإسلامي للمغرب', 'q3svdiYJovU', 90598, 5648300, '18.03.2020', 1584562071, 0, 0, 0),
(53, 'فاس في عهد الأدارسة', 'ZEpBq-CBFUk', 90598, 5648300, '18.03.2020', 1584562093, 0, 0, 0),
(54, 'مساحة متوازي المستطيلا', 'grf0D19HHdI', 90598, 823321, '18.03.2020', 1584562129, 0, 0, 0),
(55, 'مساحة المكعب', 'xvljj-V7VOA', 90598, 823321, '18.03.2020', 1584562154, 0, 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `lastvote`
--

CREATE TABLE `lastvote` (
  `id` int(11) NOT NULL,
  `ip` varchar(45) NOT NULL,
  `post` varchar(45) NOT NULL,
  `date` varchar(45) NOT NULL,
  `time` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `lastvote`
--

INSERT INTO `lastvote` (`id`, `ip`, `post`, `date`, `time`) VALUES
(1, '::1t', '5944097', '03.18.20', 1584551453),
(2, '::1w', '5944097', '03.18.20', 1584551466),
(3, '::1', '5944097', '03.18.20', 1584552375),
(4, '::1', '8142474', '03.18.20', 1584555093),
(5, '::1', '8077504', '03.18.20', 1584557098);

-- --------------------------------------------------------

--
-- Table structure for table `matier`
--

CREATE TABLE `matier` (
  `id_mat` int(11) NOT NULL,
  `name` varchar(225) NOT NULL,
  `link` varchar(225) NOT NULL,
  `date` varchar(225) NOT NULL,
  `time` int(11) NOT NULL,
  `class` varchar(225) NOT NULL,
  `vue` int(11) NOT NULL,
  `yes` int(11) NOT NULL,
  `no` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `matier`
--

INSERT INTO `matier` (`id_mat`, `name`, `link`, `date`, `time`, `class`, `vue`, `yes`, `no`) VALUES
(2, 'اللغة العربية', '3823389', '17.03.2020', 1584451046, '4321384', 34, 0, 0),
(3, 'اللغة الفرنسية', '9499017', '17.03.2020', 1584451059, '4321384', 0, 0, 0),
(4, 'اللغة الإنجليزية', '2177550', '17.03.2020', 1584451073, '4321384', 0, 0, 0),
(5, 'الاجتماعيات', '4341229', '17.03.2020', 1584451087, '4321384', 16, 1, 0),
(6, 'الرياضيات', '4448139', '17.03.2020', 1584451105, '4321384', 0, 0, 0),
(7, 'علوم الحياة والأرض', '8077504', '17.03.2020', 1584451120, '4321384', 4, 1, 0),
(8, 'الفيزياء والكيمياء', '9973310', '17.03.2020', 1584451136, '4321384', 0, 0, 0),
(9, 'الفلسفة', '5944097', '17.03.2020', 1584451151, '4321384', 85, 4, 23),
(10, 'اللغة الفرنسية', '8804508', '17.03.2020', 1584451697, '3117016', 0, 0, 0),
(11, 'اللغة الإنجليزية', '9080177', '17.03.2020', 1584451723, '3117016', 0, 0, 0),
(12, 'الاجتماعيات', '2632559', '17.03.2020', 1584451740, '3117016', 0, 0, 0),
(13, 'الرياضيات', '3393221', '17.03.2020', 1584451778, '3117016', 0, 0, 0),
(14, 'علوم الحياة والأرض', '7311679', '17.03.2020', 1584451794, '3117016', 0, 0, 0),
(15, 'الفيزياء والكيمياء', '7276454', '17.03.2020', 1584451800, '3117016', 0, 0, 0),
(16, 'عــلوم المـهـنـدس', '2424210', '17.03.2020', 1584451813, '3117016', 0, 0, 0),
(17, 'اللغة الفرنسية', '6177181', '17.03.2020', 1584451941, '9202306', 0, 0, 0),
(18, 'اللغة الإنجليزية', '6314899', '17.03.2020', 1584451955, '9202306', 0, 0, 0),
(19, 'اللغة الإسبانية', '8691394', '17.03.2020', 1584451968, '9202306', 0, 0, 0),
(20, 'الرياضيات', '2270359', '17.03.2020', 1584451980, '9202306', 0, 0, 0),
(21, 'علوم الحياة والأرض', '6276702', '17.03.2020', 1584451998, '9202306', 0, 0, 0),
(22, 'اللغة العربية', '2033166', '17.03.2020', 1584452185, '9763103', 0, 0, 0),
(23, 'اللغة الفرنسية', '8440369', '17.03.2020', 1584452198, '9763103', 0, 0, 0),
(24, 'الاجتماعيات', '6035277', '17.03.2020', 1584452211, '9763103', 0, 0, 0),
(25, 'الرياضيات', '5979421', '17.03.2020', 1584452227, '9763103', 0, 0, 0),
(26, 'علوم الحياة والأرض', '1851929', '17.03.2020', 1584452239, '9763103', 0, 0, 0),
(27, 'الفيزياء والكيمياء', '8727220', '17.03.2020', 1584452255, '9763103', 0, 0, 0),
(28, 'الفيزياء والكيمياء', '99950', '17.03.2020', 1584452268, '9763103', 0, 0, 0),
(29, 'اللغة الفرنسية', '6872522', '17.03.2020', 1584452302, '4375910', 0, 0, 0),
(30, 'الاجتماعيات', '9571082', '17.03.2020', 1584452318, '4375910', 0, 0, 0),
(31, 'الرياضيات', '3661838', '17.03.2020', 1584452330, '4375910', 0, 0, 0),
(32, 'علوم الحياة والأرض', '4549692', '17.03.2020', 1584452343, '4375910', 0, 0, 0),
(33, 'التربية الأسرية', '7819798', '17.03.2020', 1584452358, '4375910', 0, 0, 0),
(34, 'المعلوميات', '1833718', '17.03.2020', 1584452371, '4375910', 0, 0, 0),
(35, 'اللغة الفرنسية', '960777', '17.03.2020', 1584452399, '7005827', 0, 0, 0),
(36, 'الاجتماعيات', '7944106', '17.03.2020', 1584452413, '7005827', 0, 0, 0),
(37, 'الرياضيات', '3191886', '17.03.2020', 1584452428, '7005827', 0, 0, 0),
(38, 'علوم الحياة والأرض', '6611002', '17.03.2020', 1584452441, '7005827', 0, 0, 0),
(39, 'الفيزياء والكيمياء', '4473318', '17.03.2020', 1584452454, '7005827', 0, 0, 0),
(40, 'اللغة العربية', '4575535', '17.03.2020', 1584452536, '90598', 0, 0, 0),
(41, 'اللغة الفرنسية', '1529695', '17.03.2020', 1584452551, '90598', 0, 0, 0),
(42, 'الاجتماعيات', '5648300', '17.03.2020', 1584452566, '90598', 0, 0, 0),
(43, 'الرياضيات', '823321', '17.03.2020', 1584452578, '90598', 0, 0, 0),
(44, 'النشاط العلمي', '384724', '17.03.2020', 1584452592, '90598', 0, 0, 0),
(45, 'الصرف والتحويل', '1206474', '17.03.2020', 1584452604, '90598', 0, 0, 0),
(46, 'Grammaire', '1141983', '17.03.2020', 1584452616, '90598', 0, 0, 0),
(47, 'Orthographe', '1210791', '17.03.2020', 1584452635, '90598', 0, 0, 0),
(48, 'Activite de Lecture', '4354472', '17.03.2020', 1584452663, '90598', 0, 0, 0),
(49, 'communication et actes de langage', '6570117', '17.03.2020', 1584452679, '90598', 0, 0, 0),
(50, 'للغة الفرنسية', '1838009', '17.03.2020', 1584452736, '1672126', 0, 0, 0),
(51, 'الرياضيات', '5210888', '17.03.2020', 1584452745, '1672126', 0, 0, 0),
(52, 'النشاط العلمي', '6325734', '17.03.2020', 1584452760, '1672126', 0, 0, 0),
(53, 'communication et actes de langage', '2452191', '17.03.2020', 1584452768, '1672126', 0, 0, 0),
(54, 'اللغة العربية', '4236229', '17.03.2020', 1584452795, '3257537', 0, 0, 0),
(55, 'اللغة الفرنسية', '6798781', '17.03.2020', 1584452811, '3257537', 0, 0, 0),
(56, 'الرياضيات', '8407973', '17.03.2020', 1584452823, '3257537', 0, 0, 0),
(57, 'Activite de Lecture', '578714', '17.03.2020', 1584452830, '3257537', 0, 0, 0),
(58, 'اللغة العربية', '4316098', '17.03.2020', 1584452854, '3940320', 0, 0, 0),
(59, 'اللغة الفرنسية', '1648729', '17.03.2020', 1584452866, '3940320', 0, 0, 0),
(60, 'الأمازيغية', '9042753', '17.03.2020', 1584452880, '3940320', 0, 0, 0),
(61, 'النشاط العلمي', '9844404', '17.03.2020', 1584452893, '3940320', 0, 0, 0),
(62, 'Activite de Lecture', '6399668', '17.03.2020', 1584452907, '3940320', 0, 0, 0),
(63, 'poisie', '761776', '17.03.2020', 1584452920, '3940320', 0, 0, 0),
(64, 'اللغة الفرنسية', '4613426', '17.03.2020', 1584452959, '4780574', 0, 0, 0),
(65, 'الأمازيغية', '4590822', '17.03.2020', 1584452965, '4780574', 0, 0, 0),
(66, 'الرياضيات', '9793915', '17.03.2020', 1584452977, '4780574', 0, 0, 0),
(67, 'اللغة العربية', '8142474', '17.03.2020', 1584453002, '1678867', 54, 27, 7),
(68, 'الأمازيغية', '2781558', '17.03.2020', 1584453010, '1678867', 0, 0, 0),
(69, 'الرياضيات', '2652944', '17.03.2020', 1584453017, '1678867', 0, 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id_users` int(11) NOT NULL,
  `email` varchar(225) NOT NULL,
  `nember` varchar(225) NOT NULL,
  `password` varchar(225) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id_users`, `email`, `nember`, `password`) VALUES
(1, 'youssefelhaimer8@gmail.com', '123412340', 'Youssefssef');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `class`
--
ALTER TABLE `class`
  ADD PRIMARY KEY (`id_class`);

--
-- Indexes for table `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`id_cmnt`);

--
-- Indexes for table `doros`
--
ALTER TABLE `doros`
  ADD PRIMARY KEY (`id_dars`);

--
-- Indexes for table `lastvote`
--
ALTER TABLE `lastvote`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `matier`
--
ALTER TABLE `matier`
  ADD PRIMARY KEY (`id_mat`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id_users`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `class`
--
ALTER TABLE `class`
  MODIFY `id_class` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `comment`
--
ALTER TABLE `comment`
  MODIFY `id_cmnt` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `doros`
--
ALTER TABLE `doros`
  MODIFY `id_dars` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;

--
-- AUTO_INCREMENT for table `lastvote`
--
ALTER TABLE `lastvote`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `matier`
--
ALTER TABLE `matier`
  MODIFY `id_mat` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=70;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id_users` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
